#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <string.h>
float PI = 3.14159265359;

int zz_matrix[8][8] = {
	{1, 2, 6, 7, 15, 16, 28, 29},
	{3, 5, 8, 14, 17, 27, 30, 43},
	{4, 9, 13, 18, 26, 31, 42, 44},
	{10, 12, 19, 25, 32, 41, 45, 54},
	{11, 20, 24, 33, 40, 46, 53, 55},
	{21, 23, 34, 39, 47, 52, 56, 61},
	{22, 35, 38, 48, 51, 57, 60, 62},
	{36, 37, 49, 50, 58, 59, 63, 64}};

/*construct a structure of BMP header*/
typedef struct Bmpheader
{
	char identifier[2];		 // 0x0000
	unsigned int filesize;	 // 0x0002
	unsigned short reserved; // 0x0006
	unsigned short reserved2;
	unsigned int bitmap_dataoffset; // 0x000A
	unsigned int bitmap_headersize; // 0x000E
	unsigned int width;				// 0x0012
	unsigned int height;			// 0x0016
	unsigned short planes;			// 0x001A
	unsigned short bits_perpixel;	// 0x001C
	unsigned int compression;		// 0x001E
	unsigned int bitmap_datasize;	// 0x0022
	unsigned int hresolution;		// 0x0026
	unsigned int vresolution;		// 0x002A
	unsigned int usedcolors;		// 0x002E
	unsigned int importantcolors;	// 0x0032
	unsigned int palette;			// 0x0036
} Bitmap;

typedef struct RGB
{
	unsigned char R;
	unsigned char G;
	unsigned char B;
} ImgRGB;

typedef struct YCbCr
{
	float Y;
	float Cb;
	float Cr;
} ImgYCbCr;

void read_size(char *file_name, int *size);
void output_bmp(ImgRGB **RGB, FILE *outfile, Bitmap bmpheader, int skip);
void InputData(char *R_name, char *G_name, char *B_name, ImgRGB **array, int H, int W, int skip);
ImgRGB **malloc_2D(int row, int col);
ImgYCbCr **malloc_YCbCr_2D(int row, int col);
Bitmap create_header(int *size);

// decoder 1
void Read_Qtable(char *Qtable_Y, char *Qtable_Cb, char *Qtable_Cr, int QY_table[8][8], int QC_table[8][8]);
void Read_Quantization(ImgYCbCr **YCbCr_Data, char *QFY_in, char *QFCb_in, char *QFCr_in, int block_H, int block_W);
void Read_EorQ_YCbCr(ImgYCbCr **EorQ_YCbCr_Data, char *EFY_in, char *EFCb_in, char *EFCr_in, int block_H, int block_W);
